package 算法.数学.数论.模;

public class 二次剩余 {
    /*
    二次剩余:
    对于奇素数p, a与p互质
    如果存在 x^k = a (mod p)
    则称a为p的k次剩余

    a是p的二次剩余,当且仅当 a^((p-1)/2) = 1 (mod p)
    a是p的二次非剩余,当且仅当 a^((p-1)/2) = -1 (mod p)
     */
    /*
    例:
    设 p = 4k+3, 且p为质数, (a^2 + b^2) % p == 0
    求证 a % p == b % p == 0

    ① 证明 -1不是p的二次剩余
    因为 p = 4k+3
    (p-1)/2 = 2k+1为奇数
    (-1)^[(p-1)/2) = -1 (mod p)
    所以 -1不是p的二次剩余

    ② 反证法
    设 a % p != 0
    则 a^2 = -b^2 (mod p)
    (a/b)^2 = -1 (mod p)

    因为-1不是p的二次剩余, 与假设矛盾
    即 a%p==0, 同理b%p==0
     */

}
